DataProcessors/ЗаполнениеПоставщикаВРекламационныхЗаявкахНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеПоставщикаВРекламационныхЗаявкахНаВозврат</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗаполнениеПоставщикаВРекламационныхЗаявкахНаВозврат/Ext/ObjectModule.bsl
Перем ЗапросПоставщика;
Перем ЗапросПоставщикаПоЗаказу;

Процедура РегламентноеВыполнение() Экспорт 
	
	ЗапросЗаявокДляЗаполнения = Новый Запрос;
	ЗапросЗаявокДляЗаполнения.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка КАК Заявка
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	НЕ ЗаявкаНаВозвратТовары.Ссылка.Проведен
	|	И НЕ ЗаявкаНаВозвратТовары.Ссылка.ПометкаУдаления
	|	И ЗаявкаНаВозвратТовары.Ссылка.Статус = ""На согласовании""
	|	И ЗаявкаНаВозвратТовары.Тип = ""Рекламация""
	|	И ЗаявкаНаВозвратТовары.Ссылка.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	РезультатЗапросаЗаявок = ЗапросЗаявокДляЗаполнения.Выполнить();
	
	Если НЕ РезультатЗапросаЗаявок.Пустой() Тогда
		
		ВыборкаЗаявок = РезультатЗапросаЗаявок.Выбрать();
		
		Пока ВыборкаЗаявок.Следующий() Цикл
			
			Если Константы.ПоискПоставщикаСОпоройНаЗаказПокупателя.Получить() Тогда
				
				ЗапросПоставщикаПоЗаказу.УстановитьПараметр("ЗаявкаНаВозврат", ВыборкаЗаявок.Заявка);
				РезультатЗапросаПостащикаПоЗаказу = ЗапросПоставщикаПоЗаказу.Выполнить();
				
				Если НЕ РезультатЗапросаПостащикаПоЗаказу.Пустой() Тогда
					
					ЗаявкаОбъект = ВыборкаЗаявок.Заявка.ПолучитьОбъект();
					ЗаявкаОбъект.Поставщик = Константы.ОсновнойПоставщик.Получить();
					
					Попытка
						ЗаявкаОбъект.Записать();
						ТекстСообщения = "В заявку " + СокрЛП(ЗаявкаОбъект.Ссылка) + " установлен поставщик " + СокрЛП(ЗаявкаОбъект.Поставщик) + "";
						
						#Если Клиент Тогда
							Сообщить(ТекстСообщения);
						#Иначе
							
							ЗаписьЖурналаРегистрации("Заполнение поставщика в рекламационных заявках на возврат", УровеньЖурналаРегистрации.Информация, , ,
							ТекстСообщения);
							
						#КонецЕсли 
						
					Исключение
					Конецпопытки;				
					
					Продолжить;
					
				КонецЕсли;				
				
			КонецЕсли;
			
			ЗапросПоставщика.УстановитьПараметр("ЗаявкаНаВозврат",ВыборкаЗаявок.Заявка);
			
			РезультатЗапросаПоставщика = ЗапросПоставщика.Выполнить().Выгрузить();
			
			Если НЕ РезультатЗапросаПоставщика.Количество() = 0 Тогда
				
				ЗаявкаОбъект = ВыборкаЗаявок.Заявка.ПолучитьОбъект();
				ЗаявкаОбъект.Поставщик = РезультатЗапросаПоставщика[0].Поставщик;
				
				Попытка
					
					ЗаявкаОбъект.Записать();
					ТекстСообщения = "В заявку " + СокрЛП(ЗаявкаОбъект.Ссылка) + " установлен поставщик " + СокрЛП(РезультатЗапросаЗаявок[0].Поставщик) + "";
					
					#Если Клиент Тогда
						Сообщить(ТекстСообщения);
					#Иначе
						
						ЗаписьЖурналаРегистрации("Заполнение поставщика в рекламационных заявках на возврат", УровеньЖурналаРегистрации.Информация, , ,
						ТекстСообщения);
						
					#КонецЕсли 
					
				Исключение
				Конецпопытки;				
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПеременныеМодуля

ЗапросПоставщика = Новый Запрос;
ЗапросПоставщика.Текст =
"ВЫБРАТЬ
|	ЗаявкаНаВозвратТовары.Ссылка.Реализация,
|	ЗаявкаНаВозвратТовары.Номенклатура,
|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Количество,
|	ЗаявкаНаВозвратТовары.Комментарий,
|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад КАК IDСклада
|ПОМЕСТИТЬ ТабВозвращаемойНоменклатуры
|ИЗ
|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
|ГДЕ
|	ЗаявкаНаВозвратТовары.Ссылка = &ЗаявкаНаВозврат
|
|СГРУППИРОВАТЬ ПО
|	ЗаявкаНаВозвратТовары.Ссылка.Реализация,
|	ЗаявкаНаВозвратТовары.Номенклатура,
|	ЗаявкаНаВозвратТовары.Комментарий,
|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РеализацияТоваровУслугТовары.Номенклатура,
|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
|	РеализацияТоваровУслугТовары.Ссылка,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(ЗаказПокупателяТовары.Размещение, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
|			ТОГДА ТабВозвращаемойНоменклатуры.IDСклада
|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
|	КОНЕЦ КАК IDСклада
|ПОМЕСТИТЬ ТабРеализованнойНоменклатуры
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабВозвращаемойНоменклатуры КАК ТабВозвращаемойНоменклатуры
|		ПО РеализацияТоваровУслугТовары.Ссылка = ТабВозвращаемойНоменклатуры.Реализация
|			И РеализацияТоваровУслугТовары.Номенклатура = ТабВозвращаемойНоменклатуры.Номенклатура
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
|		ПО РеализацияТоваровУслугТовары.Номенклатура = ЗаказПокупателяТовары.Номенклатура
|			И РеализацияТоваровУслугТовары.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
|
|СГРУППИРОВАТЬ ПО
|	РеализацияТоваровУслугТовары.Номенклатура,
|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
|	РеализацияТоваровУслугТовары.Ссылка,
|	ТабВозвращаемойНоменклатуры.IDСклада,
|	ЗаказПокупателяТовары.Размещение
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ ПЕРВЫЕ 1
|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент КАК Поставщик
|ИЗ
|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабРеализованнойНоменклатуры КАК ТабРеализованнойНоменклатуры
|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = ТабРеализованнойНоменклатуры.Номенклатура
|			И ПоступлениеТоваровУслугТовары.СерияНоменклатуры = ТабРеализованнойНоменклатуры.СерияНоменклатуры
|			И ПоступлениеТоваровУслугТовары.Ссылка.Дата <= ТабРеализованнойНоменклатуры.Ссылка.Дата
|			И (ВЫБОР
|				КОГДА ПоступлениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
|					ТОГДА ТабРеализованнойНоменклатуры.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
|				ИНАЧЕ ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада = ТабРеализованнойНоменклатуры.IDСклада
|			КОНЕЦ)
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
|		ПО ПоступлениеТоваровУслугТовары.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
|			И ПоступлениеТоваровУслугТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
|			И ПоступлениеТоваровУслугТовары.УИД = ЗаказПоставщикуТовары.УИД
|ГДЕ
|	ПоступлениеТоваровУслугТовары.Ссылка.Проведен
|
|УПОРЯДОЧИТЬ ПО
|	ПоступлениеТоваровУслугТовары.Ссылка.Дата УБЫВ";

ЗапросПоставщикаПоЗаказу = Новый Запрос;
ЗапросПоставщикаПоЗаказу.Текст =
"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЗаявкаНаВозвратТовары.Ссылка.Реализация,
|	ЗаявкаНаВозвратТовары.Номенклатура
|ПОМЕСТИТЬ ВТ_ЗаявкаНаВозврат
|ИЗ
|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
|ГДЕ
|	ЗаявкаНаВозвратТовары.Ссылка = &ЗаявкаНаВозврат
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РеализацияТоваровУслугТовары.Номенклатура,
|	РеализацияТоваровУслугТовары.ЗаказПокупателя
|ПОМЕСТИТЬ ВТ_Реализация
|ИЗ
|	ВТ_ЗаявкаНаВозврат КАК ВТ_ЗаявкаНаВозврат
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ПО ВТ_ЗаявкаНаВозврат.Реализация = РеализацияТоваровУслугТовары.Ссылка
|			И ВТ_ЗаявкаНаВозврат.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЗаказПокупателяТовары.Номенклатура,
|	МАКСИМУМ(ЗаказПокупателяТовары.Размещение) КАК Размещение,
|	МАКСИМУМ(ЗаказПокупателяТовары.СерияНоменклатуры) КАК СерияНоменклатуры
|ПОМЕСТИТЬ ВТ_Итог
|ИЗ
|	ВТ_Реализация КАК ВТ_Реализация
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
|		ПО ВТ_Реализация.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
|			И ВТ_Реализация.Номенклатура = ЗаказПокупателяТовары.Номенклатура
|
|СГРУППИРОВАТЬ ПО
|	ЗаказПокупателяТовары.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Итог.Номенклатура,
|	ВТ_Итог.Размещение,
|	ВТ_Итог.СерияНоменклатуры
|ИЗ
|	ВТ_Итог КАК ВТ_Итог
|ГДЕ
|	НЕ ВТ_Итог.Размещение = НЕОПРЕДЕЛЕНО";
#КонецОбласти
